IanMosquera/arQ2_CnDH_Baseboard_EM2_FW/STM32_WPAN/App/custom_app.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    App/custom_app.c
  * @author  MCD Application Team
  * @brief   Custom Example Application (Server)
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "app_common.h"
#include "dbg_trace.h"
#include "ble.h"
#include "custom_app.h"
#include "custom_stm.h"
#include "stm32_seq.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "usbd_cdc_if.h"

#include "arQ_CnDH_BaseBoard.h"
#include "DateTime.h"
#include "InterruptTimer.h"
#include "InterruptSerial.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
typedef struct
{
  /* SPP */
  uint8_t               Rx_Notification_Status;
  /* USER CODE BEGIN CUSTOM_APP_Context_t */

  /* USER CODE END CUSTOM_APP_Context_t */

  uint16_t              ConnectionHandle;
} Custom_App_Context_t;

/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private defines ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macros -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
/**
 * START of Section BLE_APP_CONTEXT
 */

static Custom_App_Context_t Custom_App_Context;

/**
 * END of Section BLE_APP_CONTEXT
 */

uint8_t UpdateCharData[512];
uint8_t NotifyCharData[512];
uint16_t Connection_Handle;
/* USER CODE BEGIN PV */

extern TIM_HandleTypeDef htim16;
extern TIM_HandleTypeDef htim17;

extern UART_HandleTypeDef huart1;

extern uint8_t rxChar;

extern arQ_t arQ;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
/* SPP */
static void Custom_Rx_Update_Char(void);
static void Custom_Rx_Send_Notification(void);

/* USER CODE BEGIN PFP */
void Print_Date_Time(void);
void Check_Primary_Board(void);
void Count_PMCU_Reset(void);
void Count_Program_Counter(void);
void Five_Second_Routine(void);
void Main_Routine(void);
void Minute_Routine(void);
void One_Second_Routine(void);
void Read_Data(void);
void Reset_PMCU(void);
static void BLE_Send_String(void);
void Send_String_Over_BLE(void);
void Sync_DateTime_From_PMCU(void);
void SW1_Pressed(void);
void bprintf(char *FormatString, ...);
//>>>>>>> 1cd6e066708cafdcdaf791c449309465654d9441
/* USER CODE END PFP */

/* Functions Definition ------------------------------------------------------*/
void Custom_STM_App_Notification(Custom_STM_App_Notification_evt_t *pNotification)
{
  /* USER CODE BEGIN CUSTOM_STM_App_Notification_1 */

  /* USER CODE END CUSTOM_STM_App_Notification_1 */
  switch (pNotification->Custom_Evt_Opcode)
  {
    /* USER CODE BEGIN CUSTOM_STM_App_Notification_Custom_Evt_Opcode */

    /* USER CODE END CUSTOM_STM_App_Notification_Custom_Evt_Opcode */

    /* SPP */
    case CUSTOM_STM_TX_READ_EVT:
      /* USER CODE BEGIN CUSTOM_STM_TX_READ_EVT */

      /* USER CODE END CUSTOM_STM_TX_READ_EVT */
      break;

    case CUSTOM_STM_TX_WRITE_NO_RESP_EVT:
      /* USER CODE BEGIN CUSTOM_STM_TX_WRITE_NO_RESP_EVT */
    	pNotification->DataTransfered.pPayload[pNotification->DataTransfered.Length] = '\0';
      /* USER CODE END CUSTOM_STM_TX_WRITE_NO_RESP_EVT */
      break;

    case CUSTOM_STM_RX_READ_EVT:
      /* USER CODE BEGIN CUSTOM_STM_RX_READ_EVT */

      /* USER CODE END CUSTOM_STM_RX_READ_EVT */
      break;

    case CUSTOM_STM_RX_NOTIFY_ENABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_RX_NOTIFY_ENABLED_EVT */

      /* USER CODE END CUSTOM_STM_RX_NOTIFY_ENABLED_EVT */
      break;

    case CUSTOM_STM_RX_NOTIFY_DISABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_RX_NOTIFY_DISABLED_EVT */

      /* USER CODE END CUSTOM_STM_RX_NOTIFY_DISABLED_EVT */
      break;

    case CUSTOM_STM_NOTIFICATION_COMPLETE_EVT:
      /* USER CODE BEGIN CUSTOM_STM_NOTIFICATION_COMPLETE_EVT */

      /* USER CODE END CUSTOM_STM_NOTIFICATION_COMPLETE_EVT */
      break;

    default:
      /* USER CODE BEGIN CUSTOM_STM_App_Notification_default */

      /* USER CODE END CUSTOM_STM_App_Notification_default */
      break;
  }
  /* USER CODE BEGIN CUSTOM_STM_App_Notification_2 */

  /* USER CODE END CUSTOM_STM_App_Notification_2 */
  return;
}

void Custom_APP_Notification(Custom_App_ConnHandle_Not_evt_t *pNotification)
{
  /* USER CODE BEGIN CUSTOM_APP_Notification_1 */

  /* USER CODE END CUSTOM_APP_Notification_1 */

  switch (pNotification->Custom_Evt_Opcode)
  {
    /* USER CODE BEGIN CUSTOM_APP_Notification_Custom_Evt_Opcode */

    /* USER CODE END P2PS_CUSTOM_Notification_Custom_Evt_Opcode */
    case CUSTOM_CONN_HANDLE_EVT :
      /* USER CODE BEGIN CUSTOM_CONN_HANDLE_EVT */

      /* USER CODE END CUSTOM_CONN_HANDLE_EVT */
      break;

    case CUSTOM_DISCON_HANDLE_EVT :
      /* USER CODE BEGIN CUSTOM_DISCON_HANDLE_EVT */

      /* USER CODE END CUSTOM_DISCON_HANDLE_EVT */
      break;

    default:
      /* USER CODE BEGIN CUSTOM_APP_Notification_default */

      /* USER CODE END CUSTOM_APP_Notification_default */
      break;
  }

  /* USER CODE BEGIN CUSTOM_APP_Notification_2 */

  /* USER CODE END CUSTOM_APP_Notification_2 */

  return;
}

void Custom_APP_Init(void)
{
  /* USER CODE BEGIN CUSTOM_APP_Init */

	UTIL_SEQ_RegTask(1 << CFG_TASK_MAIN,		UTIL_SEQ_RFU, Main_Routine);
	UTIL_SEQ_RegTask(1 << CFG_TASK_SEND_STR,	UTIL_SEQ_RFU, Send_String_Over_BLE);

	sprintf(arQ.Buf.PC_MSG, "Sample string");

  /* USER CODE END CUSTOM_APP_Init */
  return;
}

/* USER CODE BEGIN FD */

void Print_Date_Time(void)
{
	xprintf(PC, "%02d/%02d/%02d, %02d:%02d %s\r\n",
				arQ.DTm.Year, arQ.DTm.Month, arQ.DTm.Days,
			   (arQ.DTm.Hour < 13) ? (arQ.DTm.Hour):(arQ.DTm.Hour-12),
			    arQ.DTm.Min,
			   (arQ.DTm.Hour < 13) ? "AM":"PM");

	bprintf("%02d/%02d/%02d, %02d:%02d %s\r\n",
			arQ.DTm.Year, arQ.DTm.Month, arQ.DTm.Days,
		   (arQ.DTm.Hour < 13) ? (arQ.DTm.Hour):(arQ.DTm.Hour-12),
			arQ.DTm.Min,
		   (arQ.DTm.Hour < 13) ? "AM":"PM");
}





void Check_Primary_Board(void)
{
	sprintf(arQ.Buf.DESIRED_RESPONSE, "PMCU_OK");
	Clear_UART_Buffers();

	xprintf(PC, "Checking PMCU: ");
	bprintf("Checking PMCU: ");
	//HAL_Delay(200);

	xprintf(PMCU, "CHECK_MCU");
	if (Get_Serial_Response())
	{
		arQ.Flg.PMCU_STAT_FLAG_OK = true;
		xprintf(PC, "%s\r\n", arQ.Buf.GSM_RESPONSE);
		bprintf("%s\r\n", arQ.Buf.GSM_RESPONSE);
	}
	else
	{
		arQ.Flg.PMCU_STAT_FLAG_OK = false;
		xprintf(PC, "PMCU Error!\r\n");
		bprintf("PMCU Error!\r\n");
	}

	Clear_UART_Buffers();
}





void Count_PMCU_Reset(void)
{
	if (arQ.Ctr.PMCU_RST_CTR == 0)
		arQ.Ctr.PMCU_RST_CTR++;
	else if (arQ.Ctr.PMCU_RST_CTR >= 2) // after 2 seconds turn on thge PMCU
		HAL_GPIO_WritePin(NRST_PMCU_GPIO_Port, NRST_PMCU_Pin, GPIO_PIN_SET);
	else
		arQ.Ctr.PMCU_RST_CTR = 1;
}




void Count_Program_Counter(void)
{
	if (arQ.Ctr.PROG_CTR >= 2401)
		arQ.Ctr.PROG_CTR = 0;
	else
		arQ.Ctr.PROG_CTR++;
}





void Five_Second_Routine(void)
{
	if (!arQ.Flg.LOCK_5S_ROUTINE)
	{
		if ((arQ.Ctr.PROG_CTR % 100) == 0)
		{
			bprintf("#");
		}
	}
}





void Main_Routine(void)
{
	bprintf("\r\n****************  Main Routine  ****************\r\n");

	Sync_DateTime_From_PMCU();
	Print_Date_Time();
	Check_Primary_Board();
	Reset_PMCU();
	Read_Data();

	arQ.Flg.LOCK_5S_ROUTINE = false;
}





void Minute_Routine(void)
{
	if ((arQ.Ctr.PROG_CTR % 1200) == 0)
	{
		//Lock 5 Sec Routine until Main task is done
		arQ.Flg.LOCK_5S_ROUTINE = true;
		UTIL_SEQ_SetTask(1 << CFG_TASK_MAIN, CFG_SCH_PRIO_0);
	}
}





void Read_Data(void)
{
	if (arQ.Flg.PMCU_STAT_FLAG_OK)
	{
		sprintf(arQ.Buf.DESIRED_RESPONSE, "#PWR:");
		Clear_UART_Buffers();
		bprintf("Reading Power Data: ");

		xprintf(PMCU, "READ_POWER");
		if (Get_Serial_Response())
		{
			bprintf("%s\r\n", arQ.Buf.GSM_RESPONSE);
		}
		else
		{
			bprintf("Power Data Error!\r\n");
		}


		sprintf(arQ.Buf.DESIRED_RESPONSE, "#SNS:");
		Clear_UART_Buffers();
		bprintf("Reading Sensor Data: ");

		xprintf(PMCU, "READ_SENSOR");
		if (Get_Serial_Response())
		{
			bprintf("%s\r\n", arQ.Buf.GSM_RESPONSE);
			// Save values somewhere
		}
		else
		{
			bprintf("Sensor Data Error!\r\n");
		}
	}
	else
	{
		bprintf("Cant Read Sensor Data, PMCU Error!\r\n");
	}

}




void Reset_PMCU(void)
{
	if (!arQ.Flg.PMCU_STAT_FLAG_OK)
	{
		HAL_GPIO_WritePin(NRST_PMCU_GPIO_Port, NRST_PMCU_Pin, GPIO_PIN_RESET);
		arQ.Ctr.PMCU_RST_CTR = 0;
	}
}




void One_Second_Routine(void)
{
	if ((arQ.Ctr.PROG_CTR % 20) == 0)
	{
		Count_arQ_Time();
		Count_PMCU_Reset();
	}
}





void Send_String_Over_BLE(void)
{
	SPP_Update_Char(CUSTOM_STM_RX, (uint8_t *)&arQ.Buf.PC_MSG[0]);
}




void Sync_DateTime_From_PMCU(void)
{
	sprintf(arQ.Buf.DESIRED_RESPONSE, "#DT:");
	Clear_UART_Buffers();

	xprintf(PC, "Sychronizing time from PMCU.\r\n");
	bprintf("Sychronizing time from PMCU.\r\n");
	//HAL_Delay(200);

	xprintf(PMCU, "GetDateTime");
	if (Get_Serial_Response())
	{
		Extract_DateTime_From_String(arQ.Buf.GSM_RESPONSE, &arQ.DTm);
		arQ.Flg.PMCU_STAT_FLAG_OK = true;
		xprintf(PC, "Current Date and Time: %s\r\n", arQ.Buf.GSM_RESPONSE);
		bprintf("Current Date and Time: %s\r\n", arQ.Buf.GSM_RESPONSE);
	}
	else
	{
		arQ.Flg.PMCU_STAT_FLAG_OK = false;
		xprintf(PC, "No Response!\r\n");
		bprintf("No Response!\r\n");
	}
}



void SW1_Pressed(void)
{
	bprintf("Switch pressed\r\n");
}


void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
  if(GPIO_Pin == SW1_Pin)
  {
  	sprintf(arQ.Buf.PC_MSG, "SW1 Pressed\r\n");
  	UTIL_SEQ_SetTask(1 << CFG_TASK_SEND_STR, CFG_SCH_PRIO_0);
  }
}


void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
	if (htim == &htim17) // every 50ms
	{
		Count_Program_Counter();
		One_Second_Routine();


		Minute_Routine(); // Highest Prio
		Five_Second_Routine();

		Blink_LED();
	}
}





void bprintf(char *FormatString, ...)
{
	va_list args;
	char *sval;
	int  ival;
	float fval;
	//char tempSTR[100]; replaced with global arQ.Buf.PC_MSG buffer
	char cdcSTR[100];
	char format[10];
	int8_t i, j, x;
	uint8_t len;

	len = strlen(FormatString);
	va_start(args, FormatString);

	for (i = 0, j = 0; j < len; i++, j++)
	{
		arQ.Buf.PC_MSG[i] = FormatString[j];

		if (FormatString[j] == '%')
		{
			arQ.Buf.PC_MSG[i] = '\0';
			j++;

			SPP_Update_Char(CUSTOM_STM_RX, (uint8_t *)&arQ.Buf.PC_MSG[0]);

			HAL_Delay(10);
			x = 0;
			format[x++] = '%';

			if (FormatString[j] != 's')
			{
				do format[x++] = FormatString[j++];
				while (FormatString[j] != 'd' && FormatString[j] != 'f');
			}

			if (FormatString[j] == 's')
			{
				sval = va_arg(args, char *);
				SPP_Update_Char(CUSTOM_STM_RX, (uint8_t *)&sval[0]);
			}
			else if (FormatString[j] == 'd')
			{
				format[x] = 'd';
				format[x+1] = '\0';
				ival = va_arg(args, int);
				sprintf(cdcSTR, format, ival);
				SPP_Update_Char(CUSTOM_STM_RX, (uint8_t *)&cdcSTR[0]);

			}
			else if (FormatString[j] == 'f')
			{
				format[x] = 'f';
				format[x+1] = '\0';
				fval = va_arg(args, double);
				sprintf(cdcSTR, format, fval);
				SPP_Update_Char(CUSTOM_STM_RX, (uint8_t *)&cdcSTR[0]);
			}
			HAL_Delay(10);
			i = -1;
		}
	}
	arQ.Buf.PC_MSG[i] = '\0';
	SPP_Update_Char(CUSTOM_STM_RX, (uint8_t *)&arQ.Buf.PC_MSG[0]);
	va_end(args);
}
/* USER CODE END FD */

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

/* SPP */
__USED void Custom_Rx_Update_Char(void) /* Property Read */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Rx_UC_1*/

  /* USER CODE END Rx_UC_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_RX, (uint8_t *)UpdateCharData);
  }

  /* USER CODE BEGIN Rx_UC_Last*/

  /* USER CODE END Rx_UC_Last*/
  return;
}

void Custom_Rx_Send_Notification(void) /* Property Notification */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Rx_NS_1*/

  /* USER CODE END Rx_NS_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_RX, (uint8_t *)NotifyCharData);
  }

  /* USER CODE BEGIN Rx_NS_Last*/

  /* USER CODE END Rx_NS_Last*/

  return;
}

/* USER CODE BEGIN FD_LOCAL_FUNCTIONS*/

/* USER CODE END FD_LOCAL_FUNCTIONS*/
